Revit 2027 API
Edge.AsCurve Method
Returns a curve that corresponds to the edge's parametric orientation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve AsCurve()
Public Function AsCurve As Curve
public:
Curve^ AsCurve()
member AsCurve : unit -> Curve
Return Value
Curve
It can be an Arc, Line, or HermiteSpline.
See Also
Reference
Edge Class
Autodesk.Revit.DB Namespace